quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3.C
		//------透明屏标志
		if(id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
		unsigned char new_id  = 0;
		new_id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id != new_id)  //重新初始化
		{
			ampsys.sysdata.Cab_Addr	=	new_id&0x3F;	

			if(new_id&0x80)
				ampsys.sysdata.MB_Flag	=	1;
			else
				ampsys.sysdata.MB_Flag	=	0;
			//------透明屏标志
		if(new_id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		
//			power_on_flag = 0;
			id = new_id;
		}
		
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void door_server(void)
{
	if(ampsys.time.LockTime>0)
	{
		if(ampsys.time.LockTime<ampUnlockOuttime-100)
		{
			if(ampGetLockSts)			//锁未打开
			{
				ampUnLock;
			}
			else if(ampsys.time.LockTime>200)
			{
				ampsys.time.LockTime	=	200-1;	//延迟500ms释放锁
			}
		}
		else
		{
			ampUnLock;
		}
	}
	else
	{
		ampResLock;
		if(0!=ampsys.request.unlock)		//请求开锁
		{
			if(ampGetLockSts)		//门状态--未打开
			{
				ampsys.status.lock			=	1;
				ampsys.status.unlockerr	=	1;//开锁失败								
			}
			else	//开锁失败
			{
				set_backlight(1);	//亮背光
				ampsys.status.lock	=	0;
				ampsys.status.unlockerr	=	0;//开锁失败
			}
			ampResLock;
			ampsys.request.unlock	=	0;	//清除开锁请求
			set_lock_status_frame();
		}
		else
		{
			if(ampGetLockSts)			//门状态--关闭
			{
				if(0==ampsys.status.lock)		//关闭门
				{
					set_backlight(0);		//关背光
					set_layer_power(0);	//关层板电源
					ampsys.status.lock	=	1;//0--锁为开状态，1--锁住状态
				}
			}
			else		//手动开门
			{
				if(1==ampsys.status.lock)	//原来为关闭状态
				{
					set_backlight(1);	//亮背光
					ampsys.status.lock	=	0;//0--锁为开状态，1--锁住状态
				}			
			}
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Server(void)
{
	unsigned char displaycode	=	0;
  static unsigned short freshen_led_time=0;
  if(freshen_led_time++>100)
  {
		freshen_led_time	=	0;
		
		displaycode	=	ampsys.led.display;
		displaycode	=	displaycode^0xFF;
		
		ampsys.led.display	=	displaycode;
		if(ampsys.led.time.rf_rx>0)
		{
			ampsys.led.time.rf_rx-=1;
		}
		else
		{
			displaycode|=0x80;
		}
		if(ampsys.led.time.rf_tx>0)
		{
			ampsys.led.time.rf_tx-=1;
		}
		else
		{
			displaycode|=0x40;
		}
		//--------------------------------
		if(ampsys.led.time.ly_rx>0)
		{
			ampsys.led.time.ly_rx-=1;
		}
		else
		{
			displaycode|=0x20;
		}
		if(ampsys.led.time.ly_tx>0)
		{
			ampsys.led.time.ly_tx-=1;
		}
		else
		{
			displaycode|=0x10;
		}
		//--------------------------------
		if(ampsys.led.time.cb_rx>0)
		{
			ampsys.led.time.cb_rx-=1;
		}
		else
		{
			displaycode|=0x08;
		}
		if(ampsys.led.time.cb_tx>0)
		{
			ampsys.led.time.cb_tx-=1;
		}
		else
		{
			displaycode|=0x04;
		}
		//--------------------------------
		if(ampsys.led.time.pc_rx>0)
		{
			ampsys.led.time.pc_rx-=1;
		}
		else
		{
			displaycode|=0x02;
		}
		if(ampsys.led.time.pc_tx>0)
		{
			ampsys.led.time.pc_tx-=1;
		}
		else
		{
			displaycode|=0x01;
		}
		
		//____________使能片选
		spi_set_nss_low(&stLed);
		SPI_I2S_SendData(stLed.port.SPIx, displaycode);				//发送数据
//    SPI_ReadWriteByteSPI(&stLed,led_stata);
		//____________取消片选	
		spi_set_nss_high(&stLed);
  }  
}






/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Tim_Server(void)
{
  //----------------PC发送
  if(ampsys.time.PcSendTime>0)
  {
    ampsys.time.PcSendTime--;
  }
  //----------------柜发送
  if(ampsys.time.CabSendTime>0)
  {
    ampsys.time.CabSendTime--;
  }
  //----------------层发送
  if(ampsys.time.LaySendTime>0)
  {
    ampsys.time.LaySendTime--;
  }
  //----------------读卡器发送
  if(ampsys.time.CardSendTime>0)
  {
    ampsys.time.CardSendTime--;
  }
  //----------------锁
  if(ampsys.time.LockTime>0)
  {
    ampsys.time.LockTime--;
  }
  //----------------拨码
  if(ampsys.time.swicthidtime>0)
  {
    ampsys.time.swicthidtime--;
  }
  //----------------运行指示灯
  if(ampsys.time.SYSLEDTime>0)
  {
    ampsys.time.SYSLEDTime--;
  }
	//----------------运行指示灯
  if(ampsys.time.BackLightTime>0)
  {
    ampsys.time.BackLightTime--;
  }	
}
//------------------------------------------------------------------------------


//--------------------------------static-configuration
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Hardware_Configuration(void)
{
  BackLight_Configuration();
	LayPower_Configuration();
	Lock_Configuration();
  SwitchID_Configuration();
  Led_Configuration();
  Communication_Configuration();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Communication_Configuration(void)
{
	IOT5302Wdef ampIOT5302W;
  //-----------------------------PC接口USART1
  api_usart_configuration_NR(ampCommPcPort,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断
  
  //-----------------------------读卡器接口USART3
  ampIOT5302W.Conf.IOT5302WPort.USARTx  = ampCommCardPort;
	ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_PORT  = ampCommCardTxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_Pin   = ampCommCardTxEnPin;
	ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_PORT  = ampCommCardRxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_Pin   = ampCommCardRxEnPin;
  ampIOT5302W.Conf.USART_BaudRate  = ampCommCardBaudRate;
  api_iot5302w_configuration(&ampIOT5302W);
	
  //-----------------------------层板接口USART2
  ampRS485Ly.USARTx  = ampCommLayPort;
  ampRS485Ly.RS485_TxEn_PORT  = ampCommLayTxEnPort;
  ampRS485Ly.RS485_TxEn_Pin   = ampCommLayTxEnPin;
	ampRS485Ly.RS485_RxEn_PORT	=	ampCommLayRxEnPort;
	ampRS485Ly.RS485_RxEn_Pin		=	ampCommLayRxEnPin;
  api_rs485_configuration_NR(&ampRS485Ly,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	
  //-----------------------------副柜接口UART4
  ampRS485Cb.USARTx  					=	ampCommCbPort;
	ampRS485Cb.RS485_TxEn_PORT	=	ampCommCbTxEnPort;
	ampRS485Cb.RS485_TxEn_Pin		=	ampCommCbTxEnPin;
	ampRS485Cb.RS485_RxEn_PORT	=	ampCommCbRxEnPort;
	ampRS485Cb.RS485_RxEn_Pin		=	ampCommCbRxEnPin;
  //api_rs485_dma_configurationIT(&ampRS485Cb,19200,maxFramesize);	//RS485_DMA配置--中断
	api_rs485_configuration_NR(&ampRS485Cb,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void SwitchID_Configuration(void)
{
  ampSwitchID.NumOfSW	=	8;
  
  ampSwitchID.SW1_PORT	=	GPIOB;
  ampSwitchID.SW1_Pin	=	GPIO_Pin_9;
  
