quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3.C
  ampSwitchID.SW2_PORT	=	GPIOB;
  ampSwitchID.SW2_Pin	=	GPIO_Pin_8;
  
  ampSwitchID.SW3_PORT	=	GPIOB;
  ampSwitchID.SW3_Pin	=	GPIO_Pin_7;
  
  ampSwitchID.SW4_PORT	=	GPIOB;
  ampSwitchID.SW4_Pin	=	GPIO_Pin_6;
  
  ampSwitchID.SW5_PORT	=	GPIOB;
  ampSwitchID.SW5_Pin	=	GPIO_Pin_5;
  
  ampSwitchID.SW6_PORT	=	GPIOB;
  ampSwitchID.SW6_Pin	=	GPIO_Pin_4;
  
  ampSwitchID.SW7_PORT	=	GPIOB;
  ampSwitchID.SW7_Pin	=	GPIO_Pin_3;
  
  ampSwitchID.SW8_PORT	=	GPIOD;
  ampSwitchID.SW8_Pin	=	GPIO_Pin_2;

	api_SwitchId_initialize(&ampSwitchID);						//

  ampsys.sysdata.Cab_Addr  = api_get_SwitchId_data_left(&ampSwitchID)&0x3F;  
  
	//------主柜标志
  if(api_get_SwitchId_data_left(&ampSwitchID)&0x80)
  {
    ampsys.sysdata.MB_Flag=1; //0--副柜，1--主柜
  }
  else
  {
    ampsys.sysdata.MB_Flag=0; //0--副柜，1--主柜
  }
	//------透明屏标志
	if(api_get_SwitchId_data_left(&ampSwitchID)&0x40)
  {
    ampsys.sysdata.Display_Flag=1; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
    ampsys.sysdata.Display_Flag=0; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Configuration(void)
{
  GPIO_Configuration_OPP50(ampBackLightPort,ampBackLightPin);
	set_backlight(0);
  //ampBakkLightOff;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void LayPower_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLayPowerPort,ampLayPowerPin);
	set_backlight(0);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lock_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLockDrPort,ampLockDrPin);
  GPIO_Configuration_IPU(ampLockSiPort,ampLockSiPin);
  ampResLock;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Configuration(void)
{
  stLed.port.SPIx 			= SPI1;
  stLed.port.nss_port  	= GPIOA;
  stLed.port.nss_pin   	= GPIO_Pin_4;
  stLed.port.clk_port 	= GPIOA;
  stLed.port.clk_pin  	= GPIO_Pin_5;
  stLed.port.miso_port  = GPIOA;
  stLed.port.miso_pin   = GPIO_Pin_6;
  stLed.port.mosi_port  = GPIOA;
  stLed.port.mosi_pin   = GPIO_Pin_7;
  stLed.port.SPI_BaudRatePrescaler_x  = SPI_BaudRatePrescaler_64;
	api_spi_configurationNR(&stLed);		//SPI接口配置
  //SPI_InitializeSPI(&stLed);			//SPI-DMA通讯方式配置
}
//------------------------------------------------------------------------------


//--------------------------------static-test
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void test_cabinet_address_none_process(void)		//未拨码柜接口发LCD测试程序
{
	static unsigned char	backlight_flag=0;
	static unsigned char	num=0;
	static unsigned char	address_none_flag=0;
  static unsigned short time=0;
	
  if(0==ampsys.sysdata.Cab_Addr)   //未拨码
  {    
		unsigned char test[]=
		{	0x7E,0x4C,0x09,0xFF,0xFF,0xFF,		//地址
			0x01,0x10,0xBF,0xD8,0xD6,0xC6,0xB0,0xE5,0xCE,0xB4,0xB2,0xA6,0xC2,0xEB,0xB2,0xE2,0xCA,0xD4,	//名称"控制板未拨码测试"
			0x02,0x09,0x74,0x65,0x73,0x74,0x2D,0xB9,0xE6,0xB8,0xF1,	//规格"test-规格"
			0x03,0x02,0x39,0x39,			//数量
			0x04,0x09,0x74,0x65,0x73,0x74,0x2D,0xB1,0xF0,0xC3,0xFB,	//别名"test-别名"
			0x05,0x09,0x74,0x65,0x73,0x74,0x2D,0xB3,0xA7,0xC9,0xCC,	//厂商"test-厂商"
			0x06,0x0B,0x63,0x6F,0x64,0x65,0x2D,0x74,0x65,0x73,0x74,0x30,0x31,	//编码"code-test01"
			0x07,0x02,0xB8,0xF6,0xBD,0x9E,0x7F};	//单位"个"
		
		if(time++>500)
		{
			time=0;		
			if(num<ampArrySize)
			{
				num+=1;
				test[37]=num/10+0x30;		//转为ASCII
				test[38]=num%10+0x30;
				
				api_set_frame((ampphydef*)test,ampCmdLcdData,0);			
				set_cache_data(LayPort,(ampphydef*)test);    		//往层板发送消息
				
				if(ampsys.sysdata.MB_Flag)
					set_cache_data(CabPort,(ampphydef*)test);    	//往副柜发送消息
			}
			else
			{
				num=0;
			}
			set_layer_power(1);
			set_door(1);
			
			//---------------------背光闪烁
			if(0!=backlight_flag)
			{
				set_backlight(1);
				backlight_flag	=	0;
			}
			else
			{
				set_backlight(0);
				backlight_flag	=	1;
			}
		}
		address_none_flag	=	1;
  }
	else
	{
		if(address_none_flag)		//表示从无拨码变为有拨码
		{
			address_none_flag	=	0;	
			
			if(ampGetLockSts)			//门状态--关闭
			{
				set_layer_power(0);	//关层板电源
				set_backlight(0);		//关背光
				ampsys.status.lock	=	1;//0--锁为开状态，1--锁住状态
			}
			else
			{
				set_layer_power(1);	//关层板电源
				set_backlight(1);		//关背光---门打开时需要打开背光
				ampsys.status.lock	=	0;//0--锁为开状态，1--锁住状态
			}
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_time_sync_frame(void)		//未拨码柜接口发LCD测试程序
{
	static unsigned long	sync_time	=	0;
	
	ampphydef frame;
	
	//-----------------------------同步时间由主板发送
	if(0==ampsys.sysdata.MB_Flag)
		return;
	//-----------------------------同步时间在空闲时发送
	if(get_cache_data(CabPort))
		sync_time=0;
	if(sync_time<600000)	//600000
	{
		sync_time++;
		return ;
	}
	frame.head=headcode;
	frame.msg.length	=	6;
	frame.msg.cmd.cmd				=	ampCmdTimeSync;
	frame.msg.cmd.rv				=	0;
	frame.msg.cmd.dir				=	0;
	frame.msg.addr.address1	=	0xFF;
	frame.msg.addr.address2	=	0xFF;
	frame.msg.addr.address3	=	0xFF;
	frame.msg.data[0]				=	0x00;		//数据暂时无用
	frame.msg.data[1]				=	0x00;		//数据暂时无用
	
	api_set_frame(&frame,ampCmdTimeSync,0);
	set_cache_data(CabPort,&frame);		//其它柜LCD板
	set_cache_data(LayPort,&frame);		//本柜LCD板
	sync_time	=	0;
	
}
#endif
